       IDENTIFICATION DIVISION.
       PROGRAM-ID. PT2.
       AUTHOR. MARIO GARCIA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE   ASSIGN TO 'NEWEMP'
                   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT PRNT-FILE    ASSIGN TO 'UR-S-PRNT'
                   ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-REC.
        88 EOF VALUE HIGH-VALUES.
        02 EMP-ID PIC 9(7).
        02 EMP-NAME.
         03 EMP-L-NAME PIC X(15).
         03 EMP-F-NAME PIC X(15).
        02 EMP-TYPE PIC 99.
        02 EMP-TITLE PIC X(17).
        02 EMP-SSN.
         03 EMP-SSN-1 PIC 9(3).
         03 EMP-SSN-2 PIC 9(2).
         03 EMP-SSN-3 PIC 9(4).
        02 FILLER PIC X(24) VALUE SPACES.
        02 EMP-DATE.
         03 EMP-DATE-M PIC 9(2).
         03 EMP-DATE-D PIC 9(2).
         03 EMP-DATE-Y PIC 9(4).
        02 FILLER PIC XX VALUE SPACES.
        02 EMP-RATE PIC 9(6).
        02 EMP-RATEV REDEFINES EMP-RATE PIC 9(4)V99.
        02 EMP-STATUS PIC X.
         88 SALARIED VALUE "S".

       FD PRNT-FILE.
       01 PRNT-REC PIC X(280).

       WORKING-STORAGE SECTION.
      * Header hard-coded to be applied to the first line
        01 CURRENT-DATE-DATA.
         02 CURRENT-DATE.
          03 CURRENT-YEAR PIC 9(4).
          03 CURRENT-MONTH PIC 9(2).
          03 CURRENT-DAY PIC 9(2).

       01 PRNT-HEADING-P1.
        02 CUR-DATE.
         03 CUR-DATE-M PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 CUR-DATE-D PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 CUR-DATE-Y PIC 9(2).

        02 FILLER PIC X(40) VALUE SPACES.
        02 FILLER PIC X(28) VALUE "THE BEST IS YET TO COME, INC".
        02 FILLER PIC X(40) VALUE SPACES.
        02 FILLER PIC X(5) VALUE "PAGE ".
        02 PRN-PAGE-CNT PIC ZZ9.

       01 PRNT-HEADING-P2.
        02 FILLER PIC X(50) VALUE SPACES.
        02 FILLER PIC X(32) VALUE "EMPLOYEE CLASSIFICATION AND PAY".
        02 FILLER PIC X(40) VALUE SPACES.

       01 PRNT-HEADING-P3.
        02 FILLER PIC X(2) VALUE SPACES.
        02 FILLER PIC X(3) VALUE "SSN".
        02 FILLER PIC X(11) VALUE SPACES.
        02 FILLER PIC X(4) VALUES "LAST".
        02 FILLER PIC X(13) VALUE SPACES.
        02 FILLER PIC X(5) VALUE "FIRST".
        02 FILLER PIC X(16) VALUE SPACES.
        02 FILLER PIC X(6) VALUE "EMP ID".
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(6) VALUE "TITLE".
        02 FILLER PIC X(17) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "TYPE".
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "DATE".
        02 FILLER PIC X(9) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "RATE".
        02 FILLER PIC X(9) VALUE SPACES.
        02 FILLER PIC X(2) VALUE "ST".

      * Template/layout for the values that shall
      * be moved  over from each record
       01 PRNT-DATA.
        02 FILLER PIC X(2) VALUE SPACES.
        02 PRN-EMP-SSN.
         03 PRN-EMP-SSN-1 PIC 9(3).
         03 FILLER PIC X VALUE "-".
         03 PRN-EMP-SSN-2 PIC 9(2).
         03 FILLER PIC X VALUE "-".
         03 PRN-EMP-SSN-3 PIC 9(4).
        02 FILLER PIC X(3) VALUE SPACES.

        02 PRN-EMP-NAME.
         03 PRN-EMP-L-NAME PIC X(15).
         03 FILLER PIC X(2) VALUE SPACES.
         03 PRN-EMP-F-NAME PIC X(15).
        02 FILLER PIC X(6) VALUE SPACES.

        02 PRN-EMP-ID PIC 9(7).
        02 FILLER PIC X(3) VALUE SPACES.

        02 PRN-EMP-TITLE PIC X(17).
        02 FILLER PIC X(6) VALUE SPACES.

        02 PRN-EMP-TYPE PIC 99.
        02 FILLER PIC X(6) VALUE SPACES.

        02 PRN-EMP-DATE.
         03 PRN-EMP-DATE-M PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 PRN-EMP-DATE-D PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 PRN-EMP-DATE-Y PIC 9(4).
        02 FILLER PIC X(3) VALUE SPACES.

        02 PRN-EMP-RATE PIC $$,$$9.99.

        02 FILLER PIC X(4) VALUE SPACES.

        02 PRN-EMP-STATUS PIC X.

       01 PAGES.
         02 PAGE-CNT PIC 9 VALUE ZERO.
      * PRINTING OF CALCULATIONS"
       01 PRNT-RECS-DATA.
        02 FILLER PIC X(33) VALUE "NUMBER OF EMPLOYEE RECORDS READ:   ".
        02 FILLER PIC XX VALUE SPACES.
        02 PRN-RECS-TOTAL PIC ZZ9.

       01 PRNT-HRY-EMP-DATA.
        02 FILLER PIC X(35) VALUE "NUMBER OF HOURLY EMPLOYEES:        ".
        02 PRN-HRY-EMP-NUM PIC ZZ9.
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(25) VALUE "AVERAGE HOURLY RATE:     ".
      * 02 PRN-AVG-HRY-RATE PIC $$,$$$.99.
        02 PRN-AVG-HRY-RATE PIC $ZZZ.99.

       01 PRNT-SRY-EMP-DATA.
        02 FILLER PIC X(35) VALUE "NUMBER OF SALARIED EMPLOYEES:      ".
        02 PRN-SRY-EMP-NUM PIC ZZ9.
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(25) VALUE "AVERAGE SALARIED RATE:   ".
      *02 PRN-AVG-SRY-RATE PIC $$,$$$.99.
        02 PRN-AVG-SRY-RATE PIC $Z,ZZZ.99.

       01 PRNT-TYPES-P1.
        02 FILLER PIC X(7) VALUE "TYPE 1:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE1-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 2:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE2-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 3:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE3-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 4:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE4-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 5:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE5-CNT PIC ZZ9.

       01 PRNT-TYPES-P2.
        02 FILLER PIC X(7) VALUE "TYPE 6:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE6-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 7:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE7-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 8:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE8-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(7) VALUE "TYPE 9:".
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-TYPE9-CNT PIC ZZ9.
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(8) VALUE "TYPE 10:".
        02 FILLER PIC X(2) VALUE SPACES.
        02 PRN-TYPE10-CNT PIC ZZ9.

      * CALCULATIONS *
       01 EMPLOYEES.
        02 RECS-TOTAL PIC 9(4) VALUE ZERO.
        02 HRY-EMP-NUM PIC 9(4) VALUE ZERO.
        02 SRY-EMP-NUM PIC 9(4) VALUE ZERO.

       01 RATES.
        02 TOTAL-HRY-RATE PIC 9(7) VALUE 0000000.
        02 AVG-HRY-RATE PIC 9(7).
        02 AVG-HRY-RATEV REDEFINES AVG-HRY-RATE PIC 9(5)V99.
        02 TOTAL-SRY-RATE PIC 9(7) VALUE 0000000.
        02 AVG-SRY-RATE PIC 9(7).
        02 AVG-SRY-RATEV REDEFINES AVG-SRY-RATE PIC 9(5)V99.

       01 TYPES.
        02 TYPE-1-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-2-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-3-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-4-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-5-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-6-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-7-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-8-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-9-NUM PIC 9(3) VALUE ZERO.
        02 TYPE-10-NUM PIC 9(3) VALUE ZERO.

       PROCEDURE DIVISION.
       MAIN.
       OPEN INPUT INPUT-FILE
       OUTPUT PRNT-FILE.

       READ INPUT-FILE INTO INPUT-REC
               AT END SET EOF TO TRUE
       END-READ

       PERFORM UNTIL EOF
           IF FUNCTION MOD (RECS-TOTAL, 10) = 0
            ADD 1 TO PAGE-CNT
            PERFORM PRINT-ALL-HEADINGS
           END-IF
          ADD 1 TO RECS-TOTAL
           IF SALARIED ADD 1 TO SRY-EMP-NUM
               ADD EMP-RATE TO TOTAL-SRY-RATE
           ELSE ADD 1 TO HRY-EMP-NUM
               ADD EMP-RATE TO TOTAL-HRY-RATE
           END-IF

           IF EMP-TYPE = 01 THEN
                   ADD 1 TO TYPE-1-NUM
           END-IF
           IF EMP-TYPE = 02 THEN
                   ADD 1 TO TYPE-2-NUM
           END-IF
           IF EMP-TYPE = 03 THEN
                   ADD 1 TO TYPE-3-NUM
           END-IF
           IF EMP-TYPE = 04 THEN
                   ADD 1 TO TYPE-4-NUM
           END-IF
           IF EMP-TYPE = 05 THEN
                   ADD 1 TO TYPE-5-NUM
           END-IF
           IF EMP-TYPE = 06 THEN
                   ADD 1 TO TYPE-6-NUM
           END-IF
           IF EMP-TYPE = 07 THEN
                   ADD 1 TO TYPE-7-NUM
           END-IF
           IF EMP-TYPE = 08 THEN
                   ADD 1 TO TYPE-8-NUM
           END-IF
           IF EMP-TYPE = 09 THEN
                   ADD 1 TO TYPE-9-NUM
           END-IF
           IF EMP-TYPE = 10 THEN
                   ADD 1 TO TYPE-10-NUM
           END-IF
          PERFORM PRINT-RESULTS
          READ INPUT-FILE INTO INPUT-REC
               AT END SET EOF TO TRUE
          END-READ
       END-PERFORM

       PERFORM PRINT-SUMMARY
       CLOSE INPUT-FILE, PRNT-FILE
       STOP RUN.

      * Write headers directly to file through the file buffer line
      * then adds spaces to the next line
       PRINT-ALL-HEADINGS.
          PERFORM PRINT-HEADING-P1.
          PERFORM PRINT-HEADING-P2.
          PERFORM PRINT-HEADING-P3.

       PRINT-HEADING-P1.
           MOVE SPACES TO PRNT-REC.
           WRITE PRNT-REC AFTER ADVANCING 4 LINES.
           MOVE FUNCTION CURRENT-DATE TO CURRENT-DATE-DATA.
           MOVE CURRENT-DAY TO CUR-DATE-D.
           MOVE CURRENT-MONTH TO CUR-DATE-M.
           MOVE CURRENT-YEAR TO CUR-DATE-Y.
           MOVE PAGE-CNT TO PRN-PAGE-CNT.
           WRITE PRNT-REC FROM PRNT-HEADING-P1 AFTER ADVANCING 1 LINE.
       PRINT-HEADING-P2.

           WRITE PRNT-REC FROM PRNT-HEADING-P2 AFTER ADVANCING 1 LINE.
       PRINT-HEADING-P3.
           WRITE PRNT-REC FROM PRNT-HEADING-P3 AFTER ADVANCING 1 LINE.
           MOVE SPACES TO PRNT-REC.
           WRITE PRNT-REC AFTER ADVANCING 1 LINE.
       PRINT-RESULTS.
          MOVE EMP-SSN-1 TO PRN-EMP-SSN-1
          MOVE EMP-SSN-2 TO PRN-EMP-SSN-2
          MOVE EMP-SSN-3 TO PRN-EMP-SSN-3
          MOVE EMP-ID TO PRN-EMP-ID
          MOVE EMP-L-NAME TO PRN-EMP-L-NAME
          MOVE EMP-F-NAME TO PRN-EMP-F-NAME
          MOVE EMP-TITLE TO PRN-EMP-TITLE
          MOVE EMP-TYPE TO PRN-EMP-TYPE
          MOVE EMP-DATE-M TO PRN-EMP-DATE-M
          MOVE EMP-DATE-D TO PRN-EMP-DATE-D
          MOVE EMP-DATE-Y TO PRN-EMP-DATE-Y
          MOVE EMP-RATEV TO PRN-EMP-RATE
          MOVE EMP-STATUS TO PRN-EMP-STATUS
          WRITE PRNT-REC FROM PRNT-DATA
          AFTER ADVANCING 1 LINES.

       PRINT-SUMMARY.
           ADD 1 TO PAGE-CNT
           PERFORM PRINT-HEADING-P1.
           PERFORM PRINT-HEADING-P2.
          MOVE RECS-TOTAL TO PRN-RECS-TOTAL
          WRITE PRNT-REC FROM PRNT-RECS-DATA
           AFTER ADVANCING 2 LINES.
           MOVE HRY-EMP-NUM TO PRN-HRY-EMP-NUM

           DIVIDE TOTAL-HRY-RATE BY HRY-EMP-NUM GIVING AVG-HRY-RATE
           ROUNDED
           MOVE AVG-HRY-RATEV TO PRN-AVG-HRY-RATE
           WRITE PRNT-REC FROM PRNT-HRY-EMP-DATA
           AFTER ADVANCING 1 LINES.
           MOVE SRY-EMP-NUM TO PRN-SRY-EMP-NUM

           DIVIDE TOTAL-SRY-RATE BY SRY-EMP-NUM GIVING AVG-SRY-RATE
           ROUNDED
           MOVE AVG-SRY-RATEV TO PRN-AVG-SRY-RATE
           WRITE PRNT-REC FROM PRNT-SRY-EMP-DATA
           AFTER ADVANCING 1 LINES.
          MOVE TYPE-1-NUM TO PRN-TYPE1-CNT
          MOVE TYPE-2-NUM TO PRN-TYPE2-CNT
          MOVE TYPE-3-NUM TO PRN-TYPE3-CNT
          MOVE TYPE-4-NUM TO PRN-TYPE4-CNT
          MOVE TYPE-5-NUM TO PRN-TYPE5-CNT
           WRITE PRNT-REC FROM PRNT-TYPES-P1
           AFTER ADVANCING 2 LINES.
          MOVE TYPE-6-NUM TO PRN-TYPE6-CNT
          MOVE TYPE-7-NUM TO PRN-TYPE7-CNT
          MOVE TYPE-8-NUM TO PRN-TYPE8-CNT
          MOVE TYPE-9-NUM TO PRN-TYPE9-CNT
          MOVE TYPE-10-NUM TO PRN-TYPE10-CNT
          WRITE PRNT-REC FROM PRNT-TYPES-P2
          AFTER ADVANCING 1 LINES.

